[
  {
    "text": "A UFP está localizada na Rua Carlos da Maia, nº 296, 4200-150 Porto, Portugal."
  },
  {
    "text": "Contacto geral da UFP: +351 225 071 300. Website oficial: www.ufp.pt"
  },
  {
    "text": "A licenciatura em Engenharia Informática da UFP oferece formação sólida em algoritmia, programação, sistemas distribuídos, IA, segurança informática e bases de dados. Tem duração de 3 anos (6 semestres) e confere 180 ECTS."
  },
  {
    "text": "Saídas profissionais da licenciatura INF: programador de software, analista de sistemas, gestor de projetos, engenheiro de software, administrador de redes, técnico de suporte e consultor em TI."
  },
  {
    "text": "O Mestrado em Engenharia Informática (MINF) da UFP tem duração de 2 anos (4 semestres), totalizando 120 ECTS. Inclui temas como computação avançada, ciência de dados, segurança e sistemas inteligentes, com dissertação ou projeto final."
  },
  {
    "text": "Saídas profissionais do mestrado em Engenharia Informática (MINF): engenheiro de software sénior, especialista em cibersegurança, investigador em IA, cientista de dados, docente universitário e consultor avançado de TI."
  },
  {
    "text": "A UFP é uma universidade privada com forte aposta na formação técnica e científica, com ligação ao mundo empresarial e à investigação aplicada."
  },
  {
    "text": "Os cursos da UFP são lecionados maioritariamente em português, mas existem unidades curriculares e programas com suporte ao inglês."
  },
  {
    "text": "Cursos oferecidos pela UFP: Engenharia Informática (INF), Mestrado em Engenharia Informática (MINF), Medicina Dentária, Psicologia, Criminologia, Ciências da Comunicação, Engenharia Civil, Enfermagem, Ciências Farmacêuticas e Ciências Biomédicas."
  },
  {
    "text": "A UFP tem parcerias com instituições internacionais, permitindo intercâmbios e programas de mobilidade para os seus estudantes."
  },
  {
    "text": "A UFP promove atividades extracurriculares como estágios, workshops, conferências e projetos de investigação em colaboração com empresas."
  },
  {
    "text": "O curso de Engenharia Informática da UFP é presencial, lecionado no campus do Porto, com laboratórios equipados e acesso a tecnologias atuais."
  },
  {
  "text": "Unidades curriculares do 1.º ano da licenciatura em Engenharia Informática incluem Programação I, Algoritmia e Estruturas de Dados, Sistemas Digitais e Matemática Discreta."
  },
  {
    "text": "No 2.º ano do curso de Engenharia Informática da UFP, os estudantes aprendem Sistemas Operativos, Redes de Computadores, Engenharia de Software e Bases de Dados."
  },
  {
    "text": "O 3.º ano inclui Inteligência Artificial, Computação Gráfica, Projeto Final e disciplinas optativas técnicas para especialização."
  },
  {
    "text": "O Mestrado em Engenharia Informática (MINF) da UFP tem duração de 2 anos (4 semestres), totalizando 120 ECTS. Inclui temas como computação avançada, ciência de dados, segurança e sistemas inteligentes, com dissertação ou projeto final."
  },
  {
    "text": "A UFP oferece apoio ao estudante com serviços de orientação académica, acompanhamento psicológico, atividades culturais e desportivas."
  },
  {
    "text": "A UFP tem uma biblioteca moderna com acesso a recursos digitais, salas de estudo e espaços de convívio para os estudantes."
  },
  {
    "text": "A UFP promove a investigação aplicada em áreas como inteligência artificial, ciência de dados, saúde digital e tecnologias emergentes."
  }
]